hybridMultiphaseFoamV7/tutorials/Example_Applications/Fracture/fracture/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonWetting);

wetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6;
    rho             [1 -3 0 0 0 0 0] 1000;   
}

nonWetting 
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-5; //in unitns of kinematic viscocity
    rho             [1 -3 0 0 0 0 0] 1;
}

//Two Phase Stuff
activateCapillarity            1;
activatePorousContactAngle     1;
SmoothingCycles		       1;
theta0 			       45;

sigma            [1 0 -2 0 0 0 0]  0.077;

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

relativePermeabilityModel  BrooksAndCorey;
capillarityModel           BrooksAndCorey;

BrooksAndCoreyCoeffs
{
    n 3;
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100;
    alpha 0.5;	
}

VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100;
    m 0.8;
}
// ************************************************************************* //
